tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "node"
cask "warp"
cask "font-jetbrains-mono-nerd-font"
cask "visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "rust-lang.rust-analyzer"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
