ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools-themes
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
esbenp.prettier-vscode
ms-vscode.cpptools
usernamehw.errorlens
sjhuangx.vscode-scheme
bradlc.vscode-tailwindcss
ms-toolsai.jupyter
vscode-icons-team.vscode-icons
dbaeumer.vscode-eslint
ms-vscode.vscode-typescript-next
rust-lang.rust-analyzer
charliermarsh.ruff
ms-python.black-formatter
ms-python.debugpy
ms-python.vscode-pylance
ms-python.python
